Revit 2024 API
BuiltInFailures.MEPCalculationFailures.NetworkErrorOverConstrained Property
 The calculation could not be performed due to overconstrained flow condition in the network.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId NetworkErrorOverConstrained { get; }
Visual Basic
Public Shared ReadOnly Property NetworkErrorOverConstrained As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ NetworkErrorOverConstrained {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.MEPCalculationFailures Class
Autodesk.Revit.DB Namespace